Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection Class
 The ProfileItemCrossSection contains the information of the cross section information for multi-cross section profiles.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileItemCrossSection
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ProfileItemCrossSection
<SerializableAttribute>
Public NotInheritable Class ProfileItemCrossSection
The ProfileItemCrossSection type exposes the following members.
Constructors
Name | Description
ProfileItemCrossSection
Initializes a new instance of the ProfileItemCrossSection class
Top
Properties
Name | Description
CrossSectionLocation |  Obsolete.
 Gets or sets a value of the property CrossSectionLocation.
CrossSectionNumber |  Obsolete.
 Gets or sets a value of the property CrossSectionNumber.
EquivalentType
 Gets or sets a value of the property EquivalentType.
Location
 Gets or sets a value of the property Location.
Number
 Gets or sets a value of the property Number.
NumberOfProfileItemAnalysisParameters
 Gets or sets a value of the property NumberOfProfileItemAnalysisParameters.
NumberOfProfileItemParameters
 Gets or sets a value of the property NumberOfProfileItemParameters.
NumberOfProfileItemUserParameters
 Gets or sets a value of the property NumberOfProfileItemUserParameters.
ProfileItemAnalysisParameters
 Gets or sets a value of the property ProfileItemAnalysisParameters.
ProfileItemParameters
 Gets or sets a value of the property ProfileItemParameters.
ProfileItemUserParameters
 Gets or sets a value of the property ProfileItemUserParameters.
ProfileSubType
 Gets or sets a value of the property ProfileSubType.
ProfileType
 Gets or sets a value of the property ProfileType.
Top
Methods
Name | Description
AddProfileItemAnalysisParamter
 adds a new profile item analisis parameter.
AddProfileItemParamter
 adds a new profile item parameter.
AddProfileItemUserParamter
 adds a new profile item user parameter.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace